{"updated_at": "2025-10-01 18:33:16", "entries": [{"name": "Monster: The Ed Gein Story", "ttconst": "tt13207736", "rmconst": "rm1620748802", "detail": "Season 3 streaming Oct. 3 on Netflix", "description": "Ryan Murphy’s true crime anthology is back to tell the tale of one of the most influential serial killers of all time, Ed Gein. Starring Charlie Hunnam, the eight-episode season will explore the murderer’s journey from mother-obsessed recluse to gruesome killer. Gein’s perverse crimes have served as inspiration for legendary horror films — including <i>Psycho</i>, <i>The Texas Chain Saw Massacre</i>, and <i>The Silence of the Lambs</i> — and those influences will appear as visual echoes throughout the series. From human-skin masks and coveted corpses to roaring chainsaws and disturbing delusions, this season of “Monster” is not for the faint of heart. <i>— Adrienne C.</i>", "relatedconst": ["nm0402271", "nm0582418", "nm10847160", "nm2590465", "nm10604776", "nm0931404"], "field14": "nm0390903"}, {"name": "The Lost Bus", "ttconst": "tt21103218", "rmconst": "rm3225006594", "detail": "Streaming Oct. 3 on Apple TV+", "description": "<i>Speed</i> + <i>Volcano</i>, with the watertight direction of Paul Greengrass (<i>United 93</i>, <i>Captain Phillips</i>), and a pair of outstanding performances from a hard-luck Matthew McConaughey and a determined America Ferrera, <i>The Lost Bus</i> maneuvers past the ‘90s disaster-thriller genre to which the film is so clearly indebted, mainly with stunning visual effects that will make you believe that Greengrass actually recreated hell on earth ... then drove a busload of kids through the middle of it! Based on the true account of a school bus driver and an elementary teacher’s race to rescue 22 children from the 2018 Camp Fire in Northern California, this ride is best on a big screen, but I suspect most everyone will idle their engines until it hits streaming on Oct 3. <i>— Alex L.</i>", "viconst": "vi382126105", "relatedconst": ["nm0000190", "nm1065229"]}, {"name": "V/H/S Halloween", "ttconst": "tt37676033", "rmconst": "rm3793922818", "detail": "Premieres Oct. 3 on Shudder", "description": "The <i>V/H/S</i> franchise just keeps going, and why shouldn't it? The marriage of two great horror sub-genres (found footage + anthology) has resulted in an endless trove of video delights, and this eighth installment might be the best in the series. Seriously. And if you’re <i>really</i> into the sub-genre, take a look at this Watchlist hand-picked by the directors of <i>V/H/S/Halloween</i>. <i>— James G.</i>", "viconst": "vi271108121", "relatedconst": ["nm2956456", "nm15877301", "nm16159171", "nm3234402"]}, {"name": "Good Boy", "ttconst": "tt35521922", "rmconst": "rm3951595778", "detail": "In theaters Oct. 3", "description": "If you’ve ever wondered why your dog stares at walls or barks at empty corners of the house, Ben Leonberg’s slow-burn horror thriller is for you. Told entirely from the perspective of Indy the dog, the humans in <i>Good Boy</i> are mostly relegated to the background as our canine hero bravely protects his owner from malevolent spirits lurking in a spooky cabin in the woods. Fun fact: Indy was raised and trained for the film, which required 400+ shooting days over three years. <i>— James G.</i>", "viconst": "vi2923218969", "relatedconst": ["nm13000055", "nm2007906", "nm0275244"]}, {"name": "Tron: Ares", "ttconst": "tt6604188", "rmconst": "rm1911143682", "detail": "In theaters Oct. 10", "description": "The third installment in this slick cyberpunk franchise plays on modern fears with an A.I. villain named Ares who slips into the real world on a dangerous mission. Jeff Bridges reprises his role as Kevin Flynn alongside a whole new cast, including Evan Peters, Greta Lee, Gillian Anderson, Jodie Turner-Smith, and Jared Leto as Ares. Speaking of Tron’s latest villain, we’re interested to see what this antagonistic A.I. is really up to, especially after hearing director Joachim Rønning describe the character as “a bit like Pinocchio.” <i>— Adrienne C.</i>", "viconst": "vi383371289", "relatedconst": ["nm0001467", "nm1404239", "nm2336966", "nm0000313", "nm0000096", "nm3853652"]}, {"name": "Roofman", "ttconst": "tt4627382", "rmconst": "rm1782429954", "detail": "In theaters Oct. 10", "description": "<i>Blue Valentine</i> and <i>The Place Beyond the Pines</i> are the kind of movies that people warn you about — do not watch without tissues, an emotional support animal, and a clear conscience for your romantic history, because otherwise, writer/director Derek Cianfrance will make you soul hurt. But, what if that masterful manipulator set his sights on ... charming an audience? And then, he hired the winsome pair of Channing Tatum and Kirsten Dunst to play his star-crossed lovers? Plus, he filled out the cast, even the small roles, with ringers like Peter Dinklage, Juno Temple, LaKeith Stanfield, Uzo Aduba, and Ben Mendelsohn? You’d only have to ask, “When can I see this absolute delight that mixes <i>Mrs. Doubtfire</i> (no, really, Cianfrance told me it was the biggest inspiration for <i>Roofman</i> during our interview) and <i>Raising Arizona</i>, but places them in a real-world, true-crime yarn that feels a bit too strange to be true?” Well, meet me Oct 10 at your local cinema, friend! I’ll buy the popcorn, you bring the therapy animal. You won’t need the support for <i>Roofman</i>, unless someone starts talking about that part in <i>Blue Valentine</i> when Gosling ... oh no, here come the waterworks! <i>— Alex L.</i>", "viconst": "vi4259432473", "relatedconst": ["nm1475594", "nm0000379", "nm0227759", "nm1017334", "nm3147751"]}, {"name": "If I Had Legs I'd Kick You", "ttconst": "tt18382850", "rmconst": "rm2117901826", "detail": "In theaters Oct. 10", "description": "Go ahead and prepare yourself for the jaw massage you’re going to need after this two-hour panic attack from writer-director Mary Bronstein. Rose Byrne stars as a woman whose life is hanging by a thread as she struggles to balance the needs of her chronically ill child, her therapy patients, and the reconstruction of her apartment ceiling after a dramatic cave in. What makes Bronstein's film so resonant (and so stressful) is that there are no single answers to the issues Byrne’s character is facing. “Tell me what to do!” she shouts repeatedly at her therapist (played by Conan O’Brien in full character), but the truth is no one knows what to do as the problems begin to compound and escalate day after day. And while everyone will be talking about Byrne and O’Brien’s acting, keep an eye out for A$AP Rocky, whose easy-going performance helps keep the blood pressure down in this year’s <i>Uncut Gems</i> for moms. <i>— Adrienne C.</i>", "viconst": "vi835700761", "relatedconst": ["nm0126284", "nm5473880", "nm0005277", "nm4359664"]}, {"name": "Anemone", "ttconst": "tt33549447", "rmconst": "rm1580184578", "detail": "In theaters Oct. 10", "description": "Daniel Day-Lewis comes out of retirement for his son, Ronan, who makes his directorial feature debut with this film about a hermit who has retreated to a life in the woods. The father-son duo co-wrote the screenplay, which sees DD-L's recluse visited by his estranged brother from a bruised past. In a rare occurrence, Sean Bean co-stars in a story where his character might actually live through the end credits. <i>— Arno K.</i>", "viconst": "vi16828441", "relatedconst": ["nm0000358", "nm0000293", "nm0608090"]}, {"name": "The Chair Company", "ttconst": "tt31987295", "rmconst": "rm1903080706", "imagealign": "top center", "detail": "Series premieres Oct. 12 on HBO Max", "description": "We like what we’ve heard about this new comedy series from Tim Robinson and Zach Kanin, even if what we’ve heard makes very little sense. The trailer, which is a masterclass in conveying vibes over plot, suggests the show is about a mild-mannered businessman whose obsession with a chair company leads him to uncover a massive conspiracy. Or, maybe he’s just losing it? Looks like we’re all going to have to tune in to find out The Truth. <i>— Adrienne C.</i>", "viconst": "vi838912025", "relatedconst": ["nm4200503", "nm13156048", "nm4050105", "nm6673559"]}, {"name": "Ballad of a Small Player", "ttconst": "tt32063098", "rmconst": "rm2249374978", "detail": "In select theaters Oct. 16; premieres Oct. 29 on Netflix", "description": "Director Edward Berger's lightweight follow-up to papal thriller <i>Conclave</i> attempts to channel Wong Kar-wai and Bi Gan for a neon-soaked lost weekend in the lush hotels and dark alleys of Macau’s gambling paradise/purgatory. Colin Farrell was made to smooth a John Waters-style pencil-thin mustache as a degenerate card shark, and Tilda Swinton is in her comfort zone as the mysterious kook trailing Farrell. But this trip is only about the sightseeing, and fails to dig below the grime and blood-soaked streets. I still recommend the virtual visit to Macau and pretty much anything with Farrell playing a dirtbag. <i>— Alex L.</i>", "viconst": "vi356435993", "relatedconst": ["nm0268199", "nm2371196", "nm0842770", "nm0409677", "nm0421105"]}, {"name": "Black Phone 2", "ttconst": "tt29644189", "rmconst": "rm2508503554", "detail": "In theaters Oct. 17", "description": "Part <i>Dream Warriors</i>-era Freddy Krueger, part ‘80s sleepaway camp slasher, <i>Black Phone 2</i> is meaner, gorier, and gives Madeleine McGraw a larger role fighting The Grabber (Ethan Hawke) alongside teen-angsty brother Mason Thames. Author Joe Hill (who wrote the original short story) pitched the sequel to director Scott Derrickson, which retcons some Grabber lore and fuels a new mystery for the plucky heroes to solve. The result is looser and more expansive, giving the cast and creators a bit more space to have some fun. <i>— James G.</i>", "viconst": "vi4287023129", "relatedconst": ["nm9296746", "nm0000160", "nm6421259", "nm0065007", "nm12346880"]}, {"name": "The Hand That Rocks the Cradle", "ttconst": "tt33502160", "rmconst": "rm1212852994", "detail": "Premieres Oct. 22 on Hulu", "description": "Verifiable scream queen Maika Monroe is taking a turn to the dark side in this remake of a wild early ‘90s thriller. Mary Elizabeth Winstead and Raúl Castillo star as a couple whose new nanny may have ulterior motives. But who is the villain and who is the victim in this domestic horror story? Don’t expect a straight remake of the original. Director Michelle Garza Cervera (<i>Huesera: The Bone Woman</i>) claims she’s built “a whole different kind of thriller.” <i>— Adrienne C.</i>", "viconst": "vi1829095449", "relatedconst": ["nm0935541", "nm1950004", "nm2140860"]}, {"name": "Springsteen: Deliver Me from Nowhere", "ttconst": "tt31923069", "rmconst": "rm2201991170", "imagealign": "right", "detail": "In theaters Oct. 24", "description": "A Brooklyn boy plays Jersey's #1 son in a biopic tuned to turn Jeremy Allen White into a movie star. JAW sings and plays guitar in the story of how Bruce Springsteen made his pivotal <i>Nebraska</i> record. I love that <i>Crazy Hearts</i> director Scott Cooper returns to the subgenre that started his career. Don't necessarily love knowing Odessa Young isn't playing an actual person; instead, she's an amalgamation of women in Bruce Springsteen's life. That's show business. <i>— Arno K.</i>", "viconst": "vi1125894169", "relatedconst": ["nm2087739", "nm0834989", "nm3747611", "nm3236159", "nm0549505"]}, {"name": "A House of Dynamite", "ttconst": "tt32376165", "rmconst": "rm643544066", "detail": "Premieres Oct. 24 on Netflix", "description": "<i> House of Dynamite</i> is a contemporary disaster movie where the only moment’s peace is the thought of Idris Elba as the US president just shooting hoops with after-school program kids. Kathryn Bigelow’s first film in eight years yanks us from that dream back into a nuclear doomsday scenario, one that screenwriter Noah Oppenheim segmented into 18-minute loops where the clock resets in a series of political and military situation rooms. The feasibility factor here makes the film a rough sit, watching expressions of helplessness and shock pass over the faces of people who have dedicated their lives to responding to domestic threats. I didn’t know how to sit in my chair, or what to do as the credits rolled, my popcorn there, barely eaten. <i>— Arno K.</i>", "viconst": "vi3204958233", "relatedconst": ["nm0272581", "nm0364813", "nm6588867", "nm0252961", "nm2773059", "nm0504832"]}, {"name": "Blue Moon", "ttconst": "tt32536315", "rmconst": "rm467702018", "detail": "In theaters Oct. 24", "description": "Who wouldn’t want to sit at a bar and listen to Ethan Hawke deliver some of the most delicious monologues in contemporary times? Richard Linklater’s assured direction makes <i>Blue Moon</i>, a single-character story about the last months of famed lyricist Lorenz Hart’s life, into something that should be watched by more than just the Broadway set. Or people, like me, who feel Hawke still is, somehow, a profoundly underrated actor. Buy a shot for Bobby Cannavale and overtip him as the bartender at Sardi’s. Margaret Qualley transcends the source material – she, like Odessa Young in <i>Springsteen: Deliver Me from Nowhere</i>, is an amalgamation of women in Hart’s life. Andrew Scott walks off with the movie as Richard Rodgers, Hart’s longtime creative partner who is quickly transitioning into his Rodgers and Hammerstein era. <i>— Arno K.</i>", "viconst": "vi147245081", "relatedconst": ["nm0000160", "nm4960279", "nm0134072", "nm0778831", "nm1171145"]}, {"name": "Chainsaw Man - The Movie: Reze Arc", "ttconst": "tt30472557", "rmconst": "rm3828069634", "detail": "In theaters Oct. 24", "description": "Chainsaw Man is tearing up the big screen for the first time this month with a new adventure that will test Denji’s skills as a demon hunter and the strength of his heart. In the film, Denji may have finally met his match when the mysterious Reze steps into his world — and we all know how cool, calm, and collected the young demon hunter is around pretty girls, right? Directed by Tatsuya Yoshihara (“Black Clover”), this highly anticipated movie is a direct sequel to the anime’s hit first season, which concluded its 12-episode run in 2022. <i>— Adrienne C.</i>", "viconst": "vi2652293145", "relatedconst": []}, {"name": "It: Welcome to Derry", "ttconst": "tt19244304", "rmconst": "rm2992800770", "detail": "Premieres Oct. 26 on HBO Max", "description": "Something bad is coming for the residents of Derry in this prequel series to Andy Muschietti’s <i>IT</i> films that may uncover the origins of Pennywise the dancing clown. Jovan Adepo (“Three Body Problem”) and Taylour Paige (<i>Zola</i>) star as a couple whose recent move to the small Maine town is complicated when a young boy goes missing. Developed for TV by Muschietti, alongside his creative partner and sister Barbara, “IT: Welcome to Derry” is based on the interlude chapters from Stephen King’s novel, which reveal the town’s sordid history and Pennywise’s 27-year cycle of terror. <i>— Adrienne C.</i>", "viconst": "vi1627768857", "relatedconst": ["nm5381254", "nm3666749", "nm0803889"]}, {"name": "The Talamasca: The Secret Order", "ttconst": "tt32596156", "rmconst": "rm1327016706", "detail": "Premieres Oct. 26 on AMC+", "description": "Anne Rice's Immortal Universe continues to expand (much like the actual universe) with &quot;The Talamasca,&quot; a new series that explores an ancient and secret order tasked with monitoring and investigating supernatural beings that exist in this realm. They've popped up a few times across the two series, both trading information from Daniel Molloy in &quot;Interview with the Vampire&quot; and monitoring and manipulating prophecies in &quot;The Mayfair Witches.&quot; Now we get to see the order from the inside through the eyes of Guy Anatole (Nicholas Denton), a fledgling agent (who does not appear in the books) and who may have some supernatural abilities of his own. With the growing number of vampires and witches appearing in the world, it makes sense why they're recruiting. <i>— Vanessa W.</i>", "viconst": "vi655411225", "relatedconst": ["nm5485987", "nm0001527", "nm0005403", "nm0091899", "nm5114966"]}, {"name": "The Witcher", "ttconst": "tt5180504", "rmconst": "rm740010754", "detail": "Season 4 premieres Oct. 30 on Netflix", "description": "Liam Hemsworth takes up the sword as Geralt of Rivia, taking over for Henry Cavill who left at the end of Season 3 due to creative differences. Hemsworth will be wielding the silver sword for the final two seasons of &quot;The Witcher,&quot; which will adapt Andrzej Sapkowski's third Witcher Saga novel, &quot;Baptism of Fire.&quot; Expect to see Geralt, Ciri, and Yennefer on the opposite ends of the continent as they start their two-season battle to reunite and become a family again. <i>— Vanessa W.</i>", "viconst": "vi69060633", "relatedconst": ["nm2955013", "nm8463347", "nm9923141", "nm5438541", "nm0000401"]}, {"name": "Bugonia", "ttconst": "tt12300742", "rmconst": "rm69777154", "imagealign": "right", "detail": "In select theaters Oct. 24", "description": "Emma Stone and Jesse Plemons are predictably superb in the latest collab with Yorgos Lanthimos’ remake of Jang Joon-hwan’s <i>Save the Green Planet!</i> The director’s use of bleak humor, violence, and plot curveballs won’t be everyone’s cup of tea. But the performances are top-notch, including an adorably sweet performance from Aidan Delbis, who adds a welcome heart to the pitch black satire. <i>— James G.</i>", "viconst": "vi3890399257", "relatedconst": ["nm1297015", "nm0687146", "nm16696974"]}]}