{"updated_at": "2025-08-11 21:45:36", "entries": [{"name": "Wednesday", "ttconst": "tt13443470", "rmconst": "rm841137922", "imagealign": "top center", "detail": "Season 2, Part 1 streaming on Netflix", "description": "Hard to believe it's been three years since Jenna Ortega first hypnotized us with her spooky and kooky “Goo Goo Muck” dance from Season 1 (and introducing the music of The Cramps to a new generation). In Season 2, Wednesday uncovers ever darker secrets at Nevermore, but it's the ghoulish ensemble that has my skin crawling, in a good way. Pugsley (Isaac Ordonez) gets more screentime as a newly enrolled student at Nevermore, Joanna Lumley of “Absolutely Fabulous” chews up the scenery as Morticia’s mother, and there are guest stars aplenty, with Lady Gaga, Steve Buscemi as the new principal, and previous on-screen Uncle Fester, Christopher Lloyd. <i>—James G.</i>", "viconst": "vi502253593", "relatedconst": ["nm4911194", "nm3528821", "nm5547023", "nm0000114", "nm0525921"]}, {"name": "Weapons", "ttconst": "tt26581740", "rmconst": "rm3705110786", "detail": "In theaters Aug. 8", "description": "Three years ago, writer-director Zach Cregger got a <i>Hereditary</i>-level reaction from horror fans with <i>Barbarian</i>. Anyone who survived what happened in that basement should embrace <i>Weapons</i>, a mystery that drops us into a town where a classroom full of kids simultaneously got out of their beds and walked away into the night. We know there was an old fashioned bidding war for the script, Redditors are handing out spoilers like candy, and the filmmaker has already signed up for a reboot (<i>Resident Evil</i>). Zach Cregger, you’ve fully arrived! <i>—Arno K.</i>", "viconst": "vi2231289881", "relatedconst": ["nm3400186", "nm0000982", "nm2403277", "nm0938950"]}, {"name": "Freakier Friday", "ttconst": "tt31956415", "rmconst": "rm1998424322", "imagealign": "align bottom", "detail": "In theaters Aug. 8", "description": "When <i>Freaky Friday</i> premiered in 2003, Millennials everywhere took notice. Whether they were finishing college or still in grade school, the entire generation felt seen as Lindsay Lohan and Jamie Lee Curtis struggled to understand each other under the strangest of circumstances. In the sequel, the mother-daughter duo won’t just swap bodies but also family roles, as Lindsay’s Anna steps into her middle-aged mom era. <i>Freakier Friday</i> also ups the ante by tossing Anna's teenage daughter and step-daughter – played by Sophia Hammons and Julia Butters – into the mix for a truly mind boggling four-way swap. As the magical comedic curse expands its reach, Anna and her mother must work together to guide the newest generation through this zany, mind-bending dilemma. <i>—Adrienne C.</i>", "viconst": "vi2970600985", "relatedconst": ["nm0000130", "nm0517820", "nm6253548", "nm9857401"]}, {"name": "The Naked Gun", "ttconst": "tt3402138", "rmconst": "rm2678099202", "detail": "In theaters", "description": "This legacy sequel to the near-perfect original trilogy may have been met with a few raised eyebrows upon its initial announcement, but a comedy dream team has been assembled to ensure that this new Police Squad honors their forefatheres. Let’s begin with Liam Neeson, who plays the son of Leslie Nielsen immortal Frank Drebin. If you don’t think the Oscar-nominated thespian has comedy chops, you haven’t seen Neeson try to perform improv in “Life’s Too Short.” “Family Guy” funny man Seth MacFarlane produces with The Lonely Island’s Akiva Schaffer directing and co-writing. And if you still aren’t sold, just watch how the teaser addresses the O.J. elephant in the room — it’s as brilliant as it is stupid, and that’s exactly the point! <i>—Alex L.</i>", "viconst": "vi3493972249", "relatedconst": ["nm0000553", "nm0000097", "nm3236159", "nm0001634", "nm0243806"]}, {"name": "Alien: Earth", "ttconst": "tt13623632", "rmconst": "rm3291658498", "imagealign": "top center", "detail": "Premieres on Hulu Aug. 12", "description": "No Ripley. No Earth as we've come to know it. This much we know about \"Fargo\" creator Noah Hawley's Alien series — oh, erm, aside from its storyline possibly retconning the entire franchise. Short story: In this series, humans encounter the first Xenomorph in 2010, over a decade before what went down on the Nostromo. If you think about Weyland-Yutani’s history, there’s a world out there where a cover-up could work. So let’s see what’s goes down as five alien organisms are transported back to Earth and Weyland-Yutani races against other companies to create synthetic beings. It’s a scenario where Ellen Ripley could actually make an appearance, and you can imagine the degree of rumors and speculation happening already. <i>—Arno K.</i>", "viconst": "vi546031641", "relatedconst": ["nm7584896", "nm0648249", "nm0204583", "nm8779346"]}, {"name": "Butterfly", "ttconst": "tt26672404", "rmconst": "rm3303717634", "imagealign": "top center", "detail": "Series premieres Aug. 13 on Prime Video", "description": "If you're looking for some family drama with your \"spy-on-the-run\" thriller, then \"Butterfly\" is a must watch this month. Based on the graphic novel series, Daniel Dae Kim stars as David Jung, a highly unpredictable former US intelligence operative living in South Korea, whose life is blown to pieces when his daughter (Reina Hardesty) shows up as an agent sent to assassinate him. What we're most looking forward to is the father/daughter mayhem that ensues when the two team up to take down the shadowy org (headed by Piper Perabo) that started it all. <i>—Vanessa W.</i>", "viconst": "vi3285501977", "relatedconst": ["nm0196654", "nm7509200", "nm0005305", "nm3050595", "nm0663174"]}, {"name": "Shin Godzilla", "ttconst": "tt4262980", "rmconst": "rm1388494082", "detail": "In theaters Aug. 14", "description": "Critics called this movie everything from a \"resurgence\" to \"bonkers\" when it was first released in 2016, but the 31st film in the Godzilla franchise is also a satire of modern work culture and politics. While the terrifying creature rages outside, the people in charge of containing the monster move helplessly from meeting to meeting as they try to decide how best to tackle their deadly problem. Now, American audiences can celebrate the award-winning film’s 4K remaster with a single-day theatrical re-release on August 14, and we insist you don’t miss it. <i>—Adrienne C.</i>", "viconst": "vi1373292569", "relatedconst": ["nm4056296", "nm1595000"]}, {"name": "Americana", "ttconst": "tt17676734", "rmconst": "rm3308226306", "detail": "In theaters Aug. 15", "description": "Tony Tost has an impressive short stack of writing credits (“Poker Face” and “Longmire” among them) so indie eyes are on his directorial debut, a Western with crime-comedy elements that places Sydney Sweeney in the middle of a showdown in her small South Dakota town after a Native American artifact hits the black market. Though the movie has sat on the shelf for a couple years after its SXSW debut, its maintained an impressive critical score leading up to its theatrical release. But that IMDb rating? Woof.<i>—Arno K.</i>", "viconst": "vi127059993", "relatedconst": ["nm2858875", "nm3236159", "nm7214498"]}, {"name": "Peacemaker", "ttconst": "tt13146488", "rmconst": "rm1644791298", "detail": "Season 2 premires on Aug 21. on HBO Max", "description": "John Cena dons the helmet once again this month for the long-awaited “Peacemaker” Season 2. This time, Cena’s aggressively patriotic mercenary must fend off attacks from the vengeful Rick Flagg Sr. (Frank Grillo) while exploring a parallel universe where Peacemaker is unbothered, thriving, and, most importantly, a beloved public figure. The eight-episode season takes place just one month after the events of James Gunn’s new <i>Superman</i> film, and you can expect a few crossovers and cameos, including Hawkgirl (Isabela Merced) and Guy Gardner (Nathan Fillion). But don’t expect your typical multiverse plot from this irreverent comedy. Gunn has promised his DCU will deal with its double-dimension plot “in a very different way.” <i>—Adrienne C.</i>", "viconst": "vi633587737", "relatedconst": ["nm1078479", "nm5335029", "nm0342029", "nm0005218", "nm1684744"]}, {"name": "Highest 2 Lowest", "ttconst": "tt31194612", "rmconst": "rm2258743810", "detail": "In theaters Aug. 22", "description": "Spike Lee adapts Akira Kurosawa's 1963 noir thriller <i>High and Low</i> and transports the story to present day Manhattan, where Denzel Washington's music mogul is about to be backstabbed in a huge business deal that also finds his son being held for ransom. Reviews from the festival circuit have done right to keep mum about how A$AP Rocky and Ice Spice's characters factor into the drama, and there's been near-universal praise for Lee's trademark style and storytelling abilities, which haven't stomped around NYC in over a decade. <i>—Arno K.</i>", "viconst": "vi497469465", "relatedconst": ["nm0000243", "nm3947644", "nm0942482", "nm5473880", "nm14039339"]}, {"name": "Honey Don't!", "ttconst": "tt30645201", "rmconst": "rm1935705602", "imagealign": "top center", "detail": "In theaters Aug. 22", "description": "Margaret Qualley reunites with wife-and-husband filmmaking team Tricia Cooke and Ethan Coen for another \"lesbian b-movie\" (their label), a follow-up to the crime comedy, <i>Drive-Away Dolls</i>, which didn't make a big splash — and, curiously, wasn't technically designed to. Qualley plays a private investigator who gets mixed up with cult leader Chris Evans and mystery woman Aubrey Plaza. The cast alone, with Qualley’s post-<i>Substance</i> recognition, could boost the movie's profile once it hits streaming (a limited theatrical run comes first). <i>—Arno K.</i>", "viconst": "vi2812856345", "relatedconst": ["nm4960279", "nm2201555", "nm0206359", "nm0262635"]}, {"name": "Splitsville", "ttconst": "tt33247023", "rmconst": "rm861388034", "imagealign": "top center", "detail": "In theaters Aug. 22", "description": "Dakota Johnson co-stars in an actual relationship comedy while people still debate whether <i>Materialists</i> belongs to the genre. <i>Splitsville</i> marks the return of writers Michael Angelo Covino and Kyle Marvin, who successfully staged an uphill battle with their indie comedy, <i>The Climb</i>. Covino directs, and the duo also co-star in a story so seemingly messy, it makes divorce look like the only option for two couples completely derailed by indiscretions. The now-everywhere Adria Arjona completes this quartet. <i>—Arno K.</i>", "viconst": "vi2164181017", "relatedconst": ["nm0424848", "nm3511834", "nm5245722", "nm5568803"]}, {"name": "Invasion", "ttconst": "tt9737326", "rmconst": "rm1673575682", "detail": "Season 3 premieres Aug. 22 on Apple TV+", "description": "After five years and two seasons, we're still not quite sure why the aliens are here or what they're doing. Are they here to destroy us? Link with us? Terraform the planet? We really couldn't tell you. If you're a fan of contemplative, slow burn sci-fi series, you might not mind the pace or the ambiguity. If not, \"Alien: Earth\" looks like it will be travelling at a faster clip. Despite all of the lingering mysteries, we're still hooked, and still invested in the pockets of interconnected characters around the globe as they fight to resist the invasion and uncover its deeper meaning. <i>—Vanessa W.</i>", "viconst": "vi1911080985", "relatedconst": ["nm7811397", "nm3101617", "nm3875456", "nm0267042", "nm7014833"]}, {"name": "Lurker", "ttconst": "tt13651462", "rmconst": "rm3659446786", "detail": "In theaters Aug. 22", "description": "Writer-director Alex Russell takes aim at the L.A. music scene with his Sundance thriller, ‘Lurker,’ tracking the ascent of Matty (Théodore Pellerin) from nobody to No. 2 in the entourage of a rising musician (Archie Madekwe). Teetering on the brink of mainstream fame, we’re given a front-row seat to celebrity obsession in the Instagram era as the lurker-lurkee relationship escalates into a no-holds-barred fight for power. Also of note: ‘Lurker’ brings us Sunny Suljic’s first adult role post ‘Mid90s’ as well as the acting debut of Felix from hip hop duo Paris Texas. <i>—Sean B.</i>", "viconst": "vi1384892441", "relatedconst": ["nm6829691", "nm5994098", "nm10023988", "nm8745719"]}, {"name": "The Roses", "ttconst": "tt31973693", "rmconst": "rm682590978", "imagealign": "top center", "detail": "In theaters Aug. 29", "description": "There’s been a lot of industry talk about the death of comedy at the box office, so will audiences embrace Olivia Colman and Benedict Cumberbatch playing highly unlikeable spouses who wage a domestic war with one another in a remake of <i>The War of the Roses</i>? <i>—Arno K.</i>", "viconst": "vi28362777", "relatedconst": ["nm1212722", "nm1469236", "nm0005049", "nm0571952", "nm6967441"]}, {"name": "Caught Stealing", "ttconst": "tt1493274", "rmconst": "rm4284318722", "imagealign": "top center", "detail": "In theaters Aug. 29", "description": "Austin Butler and Darren Aronofsky team up to unleash a crime thriller that looks suspiciously like a comedy. Based on the novel by Charlie Huston (who also wrote the screenplay), <i>Caught Stealing</i> follows Hank Thompson as his cat sitting duties make him the target of a mob of gangsters. Pursued by everyone from Liev Schreiber and Regina King to Action Bronson and Bad Bunny, Butler’s Thompson is left to run for his life as this classic “wrong man” plot unfolds across ‘90s NYC. Zoë Kravitz and Matt Smith play main support as Thompson’s girlfriend and neighbor, respectively, and we’re interested to see Aronofsky tackle something so overtly humorous within a career best known for serious, surrealist dramas. <i>—Adrienne C.</i>", "viconst": "vi1939458073", "relatedconst": ["nm2581521", "nm2368789", "nm1741002"]}, {"name": "Eyes of Wakanda", "ttconst": "tt13968252", "rmconst": "rm3082720258", "detail": "Series streaming on Disney+", "description": "The first of Ryan Coogler's Disney TV projects (and the first Phase Six series of the MCU) premieres this month with \"Eyes of Wakanda.\" Helmed by veteran storyboard artist Todd Harris, the four-episode animated miniseries follows the adventures of the Hatut Zaraze, an elite group of Wakandan warriors tasked with retrieving dangerous Vibranium artifacts throughout time from the enemies of Wakanda. The impressive voice cast includes Anika Noni Rose, Winnie Harlow, Cress Williams, and more. <i>—Vanessa W.</i>", "viconst": "vi3522086937", "relatedconst": ["nm1775091", "nm0930317", "nm0741242", "nm0930637", "nm6663210"]}, {"name": "The Bad Guys 2", "ttconst": "tt30017619", "rmconst": "rm3660692738", "detail": "In theaters", "description": "<i>The Bad Guys</i> was a total plane watch for me, and further proof I’ll see any Sam Rockwell movie. Rockwell and the original voice cast return for the sequel, which finds Mr. Wolf and his associates lured back to their criminal ways by a bad girl named Kitty Kat and her crew. I’ll wait for the movie to hit streaming, but I’m interested to see if families who made the first movie a hit (it pulled in $250 million worldwide) return to theaters for the sequel. <i>—Arno K.</i>", "viconst": "vi932366361", "relatedconst": ["nm0005377", "nm0549505", "nm6588867", "nm0732497", "nm5377144"]}]}