{"updated_at": "2025-09-10 00:34:03", "entries": [{"name": "The Conjuring: Last Rites", "ttconst": "tt22898462", "rmconst": "rm1029158658", "imagealign": "top center", "detail": "In theaters", "description": "The sprawling world of <i>The Conjuring</i> returns to its flagship series with paranormal investigators Patrick Wilson and Vera Farmiga returning as Ed and Lorraine Warren. Franchise veteran Michael Chaves (<i>The Curse of La Llorona</i>, <i>The Nun II</i>, <i>The Conjuring: The Devil Made Me Do It</i>) is directing. <i>— Adrienne C.</i>", "viconst": "vi3519596569", "relatedconst": ["nm0267812", "nm0933940", "nm12011449", "nm5228887"]}, {"name": "Task", "ttconst": "tt28013708", "rmconst": "rm3609560834", "detail": "New episodes premiere Sundays on HBO Max", "description": "The &quot;Mare of Easttown&quot; creator returns to the Philadelphia suburbs with a new detective story. Don’t look for FBI agent Mark Ruffalo's accent to go viral as he assembles a task force after a string of brutal home invasions. &quot;Task&quot; could be a contender for one of the best crime series of the year. I'm curious to see how Brad Ingelsby has drawn his new villain, because I'm still thinking about what went down in Easttown, PA. <i>— Arno K.</i>", "viconst": "vi3526739993", "relatedconst": ["nm0749263", "nm0000588", "nm2519720"]}, {"name": "Wednesday", "ttconst": "tt13443470", "rmconst": "rm841137922", "imagealign": "top center", "detail": "Season 2 streaming on Netflix", "description": "Dropping the Season 2 conclusion on the <i>actual</i> first day of school (for some kids) is absolutely sinister. But with Wednesday in a coma, the return of Weems, and a dramatic entrance by Lady Gaga on the horizon, let’s face it, homework just ain't getting done this week. <i>— James G.</i>", "viconst": "vi502253593", "relatedconst": ["nm4911194", "nm3528821", "nm5547023", "nm0000114"], "field14": "nm0525921"}, {"name": "Highest 2 Lowest", "ttconst": "tt31194612", "rmconst": "rm2258743810", "detail": "Streaming on Apple TV+", "description": "Spike Lee adapts Akira Kurosawa's 1963 noir thriller <i>High and Low</i> and transports the story to present day Manhattan, where Denzel Washington's music mogul is about to be backstabbed in a huge business deal that also finds his son being held for ransom. Reviews from the festival circuit have done right to keep mum about how A$AP Rocky and Ice Spice's characters factor into the drama, and there's been near-universal praise for Lee's trademark style and storytelling abilities, which haven't stomped around NYC in over a decade. <i>—Arno K.</i>", "viconst": "vi497469465", "relatedconst": ["nm0000243", "nm3947644", "nm0942482", "nm5473880"], "field14": "nm14039339"}, {"name": "Pools", "ttconst": "tt10343438", "rmconst": "rm4199986946", "detail": "In theaters", "description": "Commit the name Odessa A'zion to memory — the young star kicks off a handful of buzzy late-2025 appearances with this TIFF Next Wave selection. Daughter of TV veteran Pamela Adlon, A'zion will show off her chops in <i>Pools</i>, playing Kennedy, a young woman leading a group of soul-searching nearly-grads on a pool-hopping quest through their college town — all while she pieces together her identity in the wake of loss. Next, watch for her alongside Timothée Chalamet in <i>Marty Supreme</i> and in Rachel Sennott's comedy series &quot;I Love LA&quot; before the year wraps. <i>— Hannah P.</i>", "viconst": "vi573687833", "relatedconst": ["nm5570560", "nm2864252", "nm1736769", "nm0190550"]}, {"name": "Preparation for the Next Life", "ttconst": "tt31727191", "rmconst": "rm3698702082", "detail": "In theaters", "description": "Oscar-nominated director Bing Liu (<i>Minding the Gap</i>) leaps from docs to narratives with his feature debut, <i>Preparation for the Next Life</i>. Liu's adaptation of the 2014 novel offers a raw glimpse into the lives of an undocumented immigrant (Sebiye Behtiyar) and an Iraq war veteran (Fred Hechinger) living on the margins of New York. <i>— Sean B.</i>", "viconst": "vi3737700377", "relatedconst": ["nm14769108", "nm9538520"]}, {"name": "Twinless", "ttconst": "tt31322753", "rmconst": "rm3925586690", "imagealign": "top center", "detail": "In theaters", "description": "Dylan O'Brien delivers a double take-inducing performance in this dark comedy following two men who meet in a support group for twins who've lost their other half. As the meetings progress and an unlikely bromance forms, the audience quickly realizes that one of these twins is not like the others. <i>— Sean B.</i>", "viconst": "vi902285337", "relatedconst": ["nm3729721", "nm4007200"]}, {"name": "The Baltimorons", "ttconst": "tt35520290", "rmconst": "rm3048835586", "detail": "In theaters", "description": "A Christmas Eve dental emergency leads to romance; so it's <i>Before Sunrise</i>, but with bloody gauze. Jay Duplass’ first solo outing as a director features one of the best titles of the year, potential indie breakouts for co-stars Liz Larsen and Michael Strassner (who co-wrote the screenplay with Duplass), and critical praise from the early reviewer set. <i>— Arno K.</i>", "viconst": "vi769509401", "relatedconst": ["nm5738899", "nm0488839"]}, {"name": "The Fragrant Flower Blooms With Diginity", "ttconst": "tt36592690", "rmconst": "rm2189604610", "detail": "Streaming on Netflix", "description": "Sparks fly in this highly anticipated romantic series about first love that Netflix is calling “swoon-worthy.” When a boy and a girl from rival schools form a connection, they must confront their personal beliefs and contend with mounting societal barriers. Adapted from Saka Mikami’s manga, this series delivers a fresh take on the classic star-crossed lovers trope. <i>— Adrienne C.</i>", "viconst": "vi1945290777", "relatedconst": []}, {"name": "The Girlfriend", "ttconst": "tt32267726", "rmconst": "rm3596136706", "imagealign": "top center", "detail": "Premieres Sept. 10 on HBO Max", "description": "“Mom, this is Cherry.” With Olivia Cooke in the lead role, is there much more you need to know about this psycho-erotic thriller series? Just understand Cherry is here to wreak havoc in Robin Wright’s life when her son (Laurie Davidson) brings his girlfriend home to meet mom. Nearly ten years ago, the novel was a sensation, and this 6-episode series looks to overdeliver in the trash TV department. <i>— Arno K.</i>", "viconst": "vi3963013145", "relatedconst": ["nm4972453", "nm5685224", "nm0000705"]}, {"name": "Demon Slayer: Infinity Castle", "ttconst": "tt32820897", "rmconst": "rm4155029250", "detail": "In theaters Sept. 12", "description": "This beloved shonen anime is about to break records with the release of <i>Demon Slayer: Kimetsu no Yaiba — The Movie: Infinity Castle</i>, thanks to ticket pre-sales to the tune of $10 million and counting. Set after the show's Hashira Training Arc in Season 4, the new movie follows the Demon Slayer Corps as they search for Muzan Kibutsuji within his Infinity Castle. If you prefer your anime dubbed, keep an ear out for Channing Tatum, who is joining the cast as martial arts master Keizo. <i>— Adrienne C.</i>", "viconst": "vi434489369", "relatedconst": ["nm5137121", "nm2893431", "nm7770751"]}, {"name": "The Long Walk", "ttconst": "tt10374610", "rmconst": "rm3278865922", "detail": "In theaters Sept. 12", "description": "Lionsgate has assembled a dream team for this Stephen King adaptation that transforms the simple act of walking into a dystopian nightmare. Directed by Francis Lawrence (multiple <i>The Hunger Games</i> movies, <i>I Am Legend</i>), and written by JT Mollner (<i>Strange Darling</i>), <i>The Long Walk</i> follows a group of teens as they attempt to survive a state-run contest where moving too slow might be the last thing you ever do. Newcomers Cooper Hoffman (<i>Licorice Pizza</i>) and David Jonsson (<i>Alien: Romulus</i>) lead up the teen ensemble, while Mark Hamill lends his talents to the sinister role of the Major. <i>— Adrienne C.</i>", "viconst": "vi1774372889", "relatedconst": ["nm11866274", "nm9657438", "nm0000434", "nm12213794"]}, {"name": "Spinal Tap II: The End Continues", "ttconst": "tt20222166", "rmconst": "rm3961240834", "detail": "In theaters Sept. 12", "description": "The legendary talents behind <i>This is Spinal Tap</i> are returning 40 years later with a metal mockumentary sequel not to be missed. Original creators Rob Reiner, Christopher Guest, Michael McKean, and Harry Shearer have crafted a crazy return for the fictional band Spinal Tap that sees the rockers reunite after 15 years for one final, epic show. Expect appearances from your favorite comedic character actors, plus cameos from music’s biggest names, including Paul McCartney, Elton John, and Garth Brooks, among others. <i>— Adrienne C.</i>", "viconst": "vi1220659225", "relatedconst": ["nm0001302", "nm0571106", "nm0733427", "nm0001661"]}, {"name": "The History of Sound", "ttconst": "tt15799524", "rmconst": "rm3227418882", "detail": "In theaters Sept. 12", "description": "Josh O'Connor and Paul Mescal falling in love during WWI are the hottest days of the year for me. This sweeping drama follows their journey across rural New England in the summer of 1919 documenting the folk songs of the time, then through the melancholy years that follow. I am ready for this forbidden romance bummer. <i>— Arno K.</i>", "viconst": "vi2915092505", "relatedconst": ["nm8958770", "nm4853066"]}, {"name": "Gen V", "ttconst": "tt13159924", "rmconst": "rm1781249794", "imagealign": "top center", "detail": "Season 2 premieres Sept. 17 on Prime Video", "description": "Class is back in session at Godolkin University. Vought News will tell you it was the bravery of Cate Dunlap and Sam Riordan that saved the school just last year. However, if you watched &quot;The Boys,&quot; you might have a different perspective. Something about an underground lab, a virus. There have even been sightings of traitorous enemies — Starlight and Billy Butcher. Season 2 of &quot;Gen V&quot; is sure to be a showcase of how these incredible students are molded into superior beings, maybe even a part of The Seven. <i>— Virginia W.</i>", "viconst": "vi1858258969", "relatedconst": ["nm3596959", "nm3835303", "nm5828485", "nm11091923"], "field14": "nm5674649", "field15": "nm11221274"}, {"name": "Black Rabbit", "ttconst": "tt23055142", "rmconst": "rm120370946", "detail": "Premieres Sept. 18 on Netflix", "description": "Jude Law and Jason Bateman become the brothers we never wanted to meet in &quot;Black Rabbit.&quot; This mystery thriller set in the resturant world of New York questions how we define family and what we will do to keep them out of harms way. &quot;Ozark&quot; costar Laura Linney joins Bateman as they direct four of the eight episodes in the series. If that is any indication of how this show will unfold, we're anticipating high tempers, high stress, and even higher stakes. <i>— Virginia W.</i>", "viconst": "vi1514129433", "relatedconst": ["nm0000867", "nm0000179", "nm3880181", "nm1319274"], "field14": "nm0231436", "field15": "nm1671147"}, {"name": "Him", "ttconst": "tt20990442", "rmconst": "rm3130896386", "detail": "In theaters Sept. 19", "description": "Horror finally penetrates the world of professional football in this new film about what it takes to become the greatest of all time. In <i>Him</i>, a young football star finds he signed up for more than he bargained for when training with his idol takes a dark turn. IMDb rising star and former college football player Tyriq Withers steps into the lead role with Marlon Wayans playing opposite in his first non-parody horror movie. Directed by Justin Tipping and produced by Jordan Peele, <i>Him</i> will leave you asking, “What are you willing to sacrifice?” <i>— Adrienne C.</i>", "viconst": "vi1238353945", "relatedconst": ["nm10635159", "nm0005541", "nm9681752"]}, {"name": "Steve", "ttconst": "tt32985279", "rmconst": "rm29077762", "detail": "In theaters Sept. 19; premieres Oct. 3 on Netflix", "description": "The wounds inflicted by Netflix's breakout series &quot;Adolescence&quot; might be reopened (in a good way?) by this book adaptation, starring Cillian Murphy. Ever artfully tortured, the Oscar-winning actor steps into the shoes of a British reform schoolteacher navigating a class of troubled teens while battling his own demons. I'm betting on some impressive performances from the schoolboys in this retelling of Max Porter's novel, &quot;Shy.&quot; <i>— Hannah P.</i>", "viconst": "vi3979790361", "relatedconst": ["nm0614165", "nm0001808", "nm10649711", "nm3787576"], "field14": "nm0001833"}, {"name": "Wayward", "ttconst": "tt27427326", "rmconst": "rm1085059842", "detail": "Premieres on Sept. 25 on Netflix", "description": "Toni Collette running a troubled teen facility feels correct. &quot;Wayward&quot; is the new drama (which feels more like a mystery/thriller) from Mae Whitman, who formed a cult with their last Netflix series, &quot;Feel Good.&quot; Whitman co-stars as a small-town cop who follows an investigative trail that leads to Collette's school, Shady Pines. I'm unsure why that's not the title of the series. <i>— Arno K.</i>", "viconst": "vi3469264921", "relatedconst": ["nm1543343", "nm0001057"]}, {"name": "One Battle After Another", "ttconst": "tt30144839", "rmconst": "rm2789706754", "detail": "In theaters Sept. 26", "description": "Paul Thomas Anderson's risky thriller somehow is his first movie with Leonardo DiCaprio, too. DiCap plays an ex-revolutionary being pursued by Sean Penn's law enforcement agent with an unbelievable name: Steven J. Lockjaw. The trailer makes it seem Penn's goons have nabbed Leo's wife (Teyana Taylor, I love you), and the script allegedly is inspired by Thomas Pynchon's novel &quot;Vineland&quot; (PTA's <i>Inherent Vice</i> also was a Pynchon adaptation.) <i>— Arno K.</i>", "viconst": "vi2361444377", "relatedconst": ["nm0000138", "nm0000576", "nm0001125", "nm0356021"], "field14": "nm3692520", "field15": "nm14551692"}, {"name": "Eleanor the Great", "ttconst": "tt30268321", "rmconst": "rm476351234", "detail": "In theaters Sept. 26", "description": "Former Avenger Scarlett Johansson's directorial debut gives June Squibb another starring role; suddenly, one thing in the world feels right. <i>Eleanor the Great</i> maybe might be an awards contender, and as a lifelong fan of Johansson's, I am drawn to <i>Eleanor</i>, knowing it's inspired by indie films she grew up loving. <i>— Arno K.</i>", "viconst": "vi4097165337", "relatedconst": ["nm0820053", "nm7210986", "nm0372961", "nm0252230"]}, {"name": "All of You", "ttconst": "tt30852384", "rmconst": "rm4120164098", "detail": "Premieres Sept. 26 on Apple TV+", "description": "In the near-future, I can picture being with Brett Goldstein, or Imogen Poots, or with them both. You too can live out this fantasy in Apple's film, which Goldstein co-wrote, that follows two BFFs living in a world where a test helps people find their true soulmate. (You know it was created by a tech company.) So this is a will-they-won't-they-<i>can</i>-they situation? <i>— Arno K.</i>", "relatedconst": ["nm2073429", "nm1782299"]}, {"name": "Chad Powers", "ttconst": "tt31449991", "rmconst": "rm780037633", "detail": "Premieres Sept. 30 on Hulu", "description": "This isn't the first time actor Glen Powell has played a Chad on the small screen (“Scream Queens,” anyone?), but his Chad Powers portrayal may be the silliest. Co-created and produced by Powell and Michael Waldron (“Loki,” “Rick and Morty”), “Chad Powers” follows college quarterback Russ Holliday as he disguises himself in an attempt to return to the game after his bad behavior gets him dismissed. If the premise sounds familiar, it may be because the show is inspired by a sketch from actual football star Eli Manning created for his “Eli’s Place” series on ESPN+. Along for the ride are a whole host of excellent comedic actors, including Steve Zahn, Toby Huss, Clayne Crawford, Perry Mattfeld, and Xavier Mills.  <i>— Adrienne C.</i>", "viconst": "vi1741605145", "relatedconst": ["nm1412974", "nm0001872", "nm3018183", "nm0186728"]}]}