{"updated_at": "2025-07-26 06:33:15", "entries": [{"name": "Fantastic Four: First Steps", "ttconst": "tt10676052", "rmconst": "rm513971970", "detail": "In theaters", "description": "Summer Marvel movies have been a mainstay for eons, but in recent years it’s been “we have comic book content at home,” with streaming options dropping on Disney+ almost quarterly. But 2025 looks to be a return to the super screen, even as <i>The Fantastic Four: First Steps</i> adopts the amid-century modern aesthetics of \"Loki\" and the intimate marriage study of \"Wandavision\" and places it into the theatrical experience. Alongside the Bakelite and Calder eye candy, the cast is comprised of fan favorites Joseph Quinn (\"Stranger Things\"), Ebon Moss-Bachrach (\"The Bear\"), and seasoned on-screen parents Pedro Pascal and Vanessa Kirby.", "viconst": "vi2494679065", "relatedconst": ["nm0050959", "nm3948952", "nm4806449", "nm0609114"]}, {"name": "Happy Gilmore 2", "ttconst": "tt31868189", "rmconst": "rm1416205826", "detail": "Streaming on Netflix", "description": "Does the world need a long-gestating sequel to Adam Sandler’s pro-golf goof-around? No. The world deserves one. The Cult of the SandMan activated around the one-two punch of 1995’s <i>Billy Madison</i> and 1996’s original \"Gilmore\" guy, which evolved into its own cinematic industrial complex (or, Happy Madison Productions) in 1998 with the dueling releases of <i>The Wedding Singer</i> and <i>The Waterboy</i>. This sequel takes us back to the phonomenon's humble beginnings as Happy tries to regain his mojo on the green, while also reassembling original costars Christopher McDonald as sinister golf champ Shooter McGavin, Julie Bowen as Happy’s sweetheart Virginia Venit, and Ben Stiller as unhinged nursing home attendant Hal, and filling out its back nine with newcomers, like Bad Bunny, Margaret Qualley, Eminem, and Benny Safdie. Expect a cart-load of silliness, cameos from pro-golfers (like Lee Trevino and Jon Daly), and plenty of surprises from the expanded SandlerVerse, including Blake Clark as the mush-mouthed Farmer Fran.", "viconst": "vi1970194713", "relatedconst": ["nm0001191", "nm0001520", "nm0100866", "nm0004896", "nm9559545", "nm1509478"]}, {"name": "Together", "ttconst": "tt31184028", "rmconst": "rm892113410", "imagealign": "center top", "detail": "In theaters Friday, July 30", "description": "Even seasoned horror fans are sure to get a rush from Michael Shanks’ body horror bonanza. Starring real-life couple Dave Franco and Allison Brie, <i>Together</i> follows Tim and Millie as they leave city life behind for Millie’s new job out in the suburbs. Unfortunately, the duo don’t seem destined for domestic bliss. Tim, a musician without a driver’s license, feels trapped in the country, while Millie fears they may have fallen out of love. What they don’t know is that these worries will pale in comparison to what’s waiting for them out in the woods. Under no circumstances should you watch a single trailer or read a review for <i>Together</i>. Yes, there are some classic horror tropes at play here, but it’s the execution of those elements that makes this film so fresh. Instead, hold out for the release to see this squishy, squelchy, stretchy, slam dunk horror comedy.", "viconst": "vi2048051481", "relatedconst": ["nm1555340", "nm2002649", "nm0380632"]}, {"name": "Superman", "ttconst": "tt5950044", "rmconst": "rm3683607809", "detail": "In theaters", "description": "We're super excited for <i>Superman: Legacy</i>, the first film in James Gunn and Peter Safran's DC Universe reboot and latest incarnation of the iconic hero. Departing from Zack Snyder's darker interpretation, Gunn promises \"a Superman who is about kindness, love, and compassion ... the best of humanity, even though he is an alien from outer space.\" We can definitely get behind that. <i>Legacy</i> explores one of our favorite eras in Superman's history: Clark Kent's early years as he tries to make sense of being a superhero on Earth – though the planet already seems to have its fill of heroes, as we've spotted Hawkgirl, Mister Terrific, and Green Lantern in the trailers. With Frank Grillo set to reprise his role as Rick Flag Sr. from \"Creature Commandos,\" we're hoping that more characters from the animated series might also be making the leap to live action.", "viconst": "vi2009516313", "relatedconst": ["nm4825178", "nm3014031", "nm0396558", "nm0277213", "nm0342029"]}, {"name": "Untamed", "ttconst": "tt31710822", "rmconst": "rm2225440514", "imagealign": "top right", "detail": "Now streaming on Netflix", "description": "While America's National Parks face real-world threats from both the political climate and the actual climate climate, consider escaping into Netflix’s latest breakout series, a crime-drama that revives Eric Bana’s leading man status, as he plays a Park Services special agent investigating a murder in Yosemite.", "viconst": "vi4260218905", "relatedconst": ["nm0051509", "nm0000554", "nm1679669", "nm2062731", "nm1569067"]}, {"name": "The Summer I Turned Pretty", "ttconst": "tt14016500", "rmconst": "rm2341961730", "imagealign": "center top", "detail": "Now streaming on Prime Video", "description": "The final season of “The Summer I Turned Pretty” promises to be an unforgettable conclusion to Prime Video’s hit coming-of-age series. Belly’s (Lola Tung) final blissful summer as a college student is shaken when her first love Conrad (Christopher Briney) suddenly comes back into her life. With a marriage proposal hanging in the balance, and parental tensions running high, Belly must finally decide who has her heart and where to find her destiny.", "viconst": "vi1207093273", "relatedconst": ["nm12528485", "nm10447374", "nm3918709"]}, {"name": "Dexter: Resurrection", "ttconst": "tt33043892", "rmconst": "rm1253030402", "detail": "Now streaming on Paramount+", "description": "Dark passengers assemble in the latest Dexter sequel series. The last time we saw Michael C. Hall’s kindly serial killer, he had been shot by his son in the shocking conclusion to “Dexter: New Blood.” But beloved characters never die, and this summer Dexter is getting resurrected for 10 more episodes of TV mayhem, this time in New York City. There he’ll meet a series of psychos played by Peter Dinklage, Uma Thurman, Krysten Ritter, Neil Patrick Harris, Eric Stonestreet, and David Dastmalchian, who appear to be forming the serial killer version of the Avengers for reasons we expect will be out of control in all the best ways.", "viconst": "vi3078998041", "relatedconst": ["nm0355910", "nm0227759", "nm0000235", "nm1269983", "nm7165060"]}, {"name": "I Know What You Did Last Summer", "ttconst": "tt4045450", "rmconst": "rm2814410754", "imagealign": "center top", "detail": "In theaters", "description": "Look, we <i>all</i> already know what the youth of Southport, North Carolina did last summer, but that won’t stop us from heading to the theater to see the fourth film in this slasher franchise. Director Jennifer Kaytin Robinson and writer Leah McKendrick have promised fans a flick that is “more brutal” while retaining the fun popcorn-tossing scares of the original. “It is not a serious movie,” Robinson told People magazine, and we celebrate that fact. This time, Jonah Hauer-King, Sarah Pidgeon, Chase Sui Wonders, Madelyn Cline, and Tyriq Withers will take on the terrifying Fisherman as he hacks, harpoons, and hooks his way to retribution. Fortunately, Jennifer Love Hewitt and Freddy Prinze Jr. will reprise their roles to help these doomed Zoomers through the worst summer of their lives.", "viconst": "vi1241040921", "relatedconst": ["nm3218692", "nm3681769", "nm5999355", "nm10635159", "nm6543142"]}, {"name": "Star Trek: Strange New Worlds", "ttconst": "tt12327578", "rmconst": "rm2279893761", "detail": "Now streaming on Paramount+", "description": "Trekkies have been loving Star Trek’s return to the time-honoured tradition of episodic storytelling in “Strange New Worlds.” But Season 3 will be kicking things off with another beloved franchise format: the two-part cliffhanger. When we last saw Captain Pike and the Enterprise crew, their rescue mission had gone awry, leaving some members captured by the Gorn and the Captain unsure what to do next. The season will drop two episodes on July 17 so fans can see both the conclusion and a little more of what’s in store for Starfleet this summer as they seek out new life and new civilizations.", "viconst": "vi730777625", "relatedconst": ["nm0609845", "nm0669656", "nm0005381", "nm2925304", "nm4563953", "nm2129802"]}, {"name": "Eddington", "ttconst": "tt31176520", "rmconst": "rm2375909890", "detail": "In theaters", "description": "Pedro Pascal is one of the brightest stars in our galaxy, but is the summer movie season ready for Ari Aster’s take on how COVID shaped the current American sociopolitical climate? Mayor Pascal faces off against Sheriff Joaquin Phoenix in small town New Mexico over their local pandemic mandates, with Emma Stone playing Phoenix’s QAnon-programmed wife and Austin Butler popping up as a far-right YouTuber. And there’s some AI nefariousness underneath the surface tensions. It’s a bold bet for A24 to drop a high-tension satire smack in the middle of July, and a huge creative risk for Aster after his last release, <i>Beau Is Afraid</i>, didn’t scare up much of an audience.", "viconst": "vi938526745", "relatedconst": ["nm0001618", "nm0050959", "nm2093766", "nm0640055", "nm7906702", "nm1297015"]}, {"name": "Foundation", "ttconst": "tt0804484", "rmconst": "rm389987074", "detail": "Now streaming on Apple TV+", "description": "Are you down for more of The Mule <i>and</i> to potentially meet Magnifico Giganticus? If you know who we’re talking about (and why), chances are you aren’t the kind of people who need to pause every “Foundation” episode to get a better understanding of what’s taking place so beautifully on Apple TV+. Not since “The Expanse” have we fully surrendered to a sci-fi series and deep-dived after every episode, every season to learn more about Isaac Asimov’s world. In Season 3, it looks like the Galactic Empire and the First and Second Foundations finally might align against the singular force who can destroy everything they’re already at war over, and you can 100% look forward to more of Lee Pace doing his Jesus in the desert thing.", "viconst": "vi2901526553", "relatedconst": ["nm1195855", "nm0364813", "nm10306608", "nm1561982", "nm1285342", "nm8653960"]}, {"name": "Jurassic World Rebirth", "ttconst": "tt31036941", "rmconst": "rm1150392066", "imagealign": "center top", "detail": "In theaters", "description": "Technically, <i>Jurassic World: Rebirth</i> is a continuation of 2022’s <i>Jurassic World: Dominion</i>, but you needn’t have seen (or even remember) that movie in order to pick up what director Gareth Edwards is laying down in this standalone story that’s desperate to kick off a brand new movie trilogy. So it’s bye-bye to Chris Pratt and Bryce Dallas Howard and hello again to screenwriter David Koepp, who wrote the first two Jurassic Park movies. Koepp has assured us there will be no franchise retconning; instead, we’ll be dropped into the middle of a remote island – the original JP research facility – where Scarlett Johannson, Mahershala Ali and Jonathan Bailey have to successfully complete some intense “Survivor”-style challenges in order to procure dino DNA for Big Pharma. Common side effects include …", "viconst": "vi3122317593", "relatedconst": ["nm0424060", "nm0991810", "nm0047332", "nm1670029", "nm2718355", "nm4534098"]}, {"name": "The Institute", "ttconst": "tt10946316", "rmconst": "rm3826498050", "detail": "Now streaming on MGM+", "description": "It’s been a heck of a year for Stephen King on screen, and the adaptation train is still going strong. Up next is “The Institute,” a supernatural horror story with some classic King themes, like shadowy organizations, kids in peril, and, of course, telekinesis. The eight-episode series tells the tale of Luke Ellis (Joe Freeman), a gifted boy who is kidnapped and imprisoned in a place called The Institute, where kids are tested (and tortured) to try to develop their psychic abilities. We’re excited for more Mary-Louise Parker on our screens, as she steps into the role of The Institute’s head honcho, Ms. Sigsby.", "viconst": "vi1777387545", "relatedconst": ["nm16550325", "nm0000571", "nm0724995", "nm10053471"]}, {"name": "The Old Guard 2", "ttconst": "tt14961624", "rmconst": "rm3485368322", "imagealign": "center 20", "detail": "Streaming on Netflix", "description": "Charlize Theron reunites with her band of immortal mercenaries charged with defending the Earth, with most of the original cast reprising their roles. Uma Thurman joins the franchise as the baddie (who’s also a baddie), an original immortal out to exterminate humankind. Also entering the fray is a bearded Henry Golding, but who are we kidding? We’re tuning in to watch two action icons collide in an epic showdown between Theron and Thurman.", "viconst": "vi229296153", "relatedconst": ["nm0000234", "nm8460487", "nm0252230", "nm6525901", "nm0000235"]}, {"name": "Heads of State", "ttconst": "tt13357520", "rmconst": "rm3961895426", "imagealign": "center top", "detail": "Streaming on Prime Video", "description": "Two veterans of James Gunn’s <i>The Suicide Squad</i> are reunited as the UK Prime Minister and US President in a wild buddy action comedy from the director of 2021’s <i>Nobody</i>. Idris Elba and John Cena star as two of the beefiest world leaders since <i>Idiocracy</i>’s President Camacho, who must work together to stop a dangerous consipiracy. Along for the ride is Priyanka Chopra Jonas as the MI6 agent who must protect them. If there were seatbelts for your eyeballs, we’d advise putting them on before boarding.", "viconst": "vi143312921", "relatedconst": ["nm0252961", "nm1078479", "nm1231899", "nm0175916", "nm0001303"]}, {"name": "The Summer Hikaru Died", "ttconst": "tt33028568", "rmconst": "rm3574577154", "detail": "Streaming on Netflix", "description": "Manga fans have been waiting for a studio to adapt “The Summer Hikaru Died” ever since the first chapter was published via Young Ace Up back in 2021. And once you hear the premise, you’ll understand why. Yoshiki’s world is upended when his best friend, Hikaru, returns from a hiking trip and is … changed somehow. Something has taken over Hikaru’s body, mind, and memories, causing everything in their lives to slowly unravel. Equal parts slice-of-live, cosmic horror, and love story, “The Summer Hikaru Died” is an excellent pick for viewers looking for a compelling tale that defies easy definition.", "viconst": "vi3847604505"}, {"name": "Nyaight of the Living Cat", "ttconst": "tt31435652", "rmconst": "rm834713858", "detail": "Streaming on Crunchyroll", "description": "There’s no end to the cuteness in this new horror-comedy about the end of the world. In the year 20XX, a mysterious virus is causing people to turn into cats whenever they come into contact with the cuddly creatures. Among the survivors is Kunagi (Masaaki Mizunaka), a man with a mysterious past and a deep knowledge of cats. Can Kunagi’s feline finesse keep the few remaining humans alive? Or, will the pull to pet bring their doom? Celebrated horror director Takashi Miike (<i>Audition</i>, <i>Ichi the Killer</i>) serves as executive director with Tomohiro Kamitani (“One Punch Man”) directing this series that feels destined to be a hit. Or, as original manga creator Hawkman told Crunchyroll, “It seems that the adorableness of cats is without limits.”", "viconst": "vi1653393433"}]}